app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all.order(updated_at: :desc)
---
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."updated_at" DESC

  def create
    @contact = Contact.new(contact_params)
    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES ('Valdimir ', 'putin@russia.com', 'I''m the real shogun', '2026-02-02 07:55:47.826987', '2026-02-02 07:55:47.826987') RETURNING "id"

  def update
    @contact = Contact.find(params[:id])
    if @contact.update(update_contact_params)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 16 LIMIT 1
UPDATE "contacts" SET "message" = 'lets make deals', "updated_at" = '2026-01-31 10:21:05.981412' WHERE "contacts"."id" = 15