app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all.order(created_at: :desc)
---
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."created_at" DESC